def what_to_do():

    print(""" Напишите программу, которая проверяла бы
    корректность сгенерированных дат. Основной функцией
    программы должна быть функция check_dates(*dates), которая
    принимает на вход произвольное количество дат от
    пользователя.
    В конце работы функция должна вернуть список всех
    корректных дат, а также их количество, самую раннюю и самую
    позднюю дату, список будущих дат относительно текущего дня.
    Если же функция встретила некорректную дату, но она должна
    пропустить её и вывести на консоль соответствующее
    предупреждение """)




